app/controllers/create_controller.rb

INSERT INTO "contacts" ("Name", "Phone", "Email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Name", "Test"], ["Phone", "0663282122"], ["Email", "ismail.haouam@epitech.eu"], ["created_at", "2020-08-17 14:06:37.534531"], ["updated_at", "2020-08-17 14:06:37.534531"]]
UPDATE "contacts" SET "Name" = $1, "Phone" = $2, "Email" = $3, "Interest" = $4, "updated_at" = $5 WHERE "contacts"."id" = $6  [["Name", "test"], ["Phone", "test"], ["Email", "test"], ["Interest", "test"], ["updated_at", "2020-08-17 12:45:51.558003"], ["id", 11]]
INSERT INTO "contacts" ("Name", "Phone", "Email", "Interest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["Name", "test2"], ["Phone", "2"], ["Email", "2"], ["Interest", "2"], ["created_at", "2020-08-17 12:46:45.392355"], ["updated_at", "2020-08-17 12:46:45.392355"]]
---
    def add
        object = Contact.create(Name: params['name'], Phone: params['pnumber'], Email: params['email'], Interest: params['interest'])
        object.save()