app/controllers/index_controller.rb

    def index
        @contacts = Contact.all.to_a
---
SELECT "contacts".* FROM "contacts"